backend/app/services/nutritionists_services/pending_requests.rb

    def call
      nutritionist = Nutritionist.find(@nutritionist_id)
      appointments = Appointment.where(nutritionist_id: nutritionist.id, status_id: 1).includes(:guest)
---
SELECT "nutritionists".* FROM "nutritionists" WHERE "nutritionists"."id" = 1 LIMIT 1
SELECT "guests".* FROM "guests" WHERE "guests"."id" IN (9, 10, 11)
SELECT "appointments".* FROM "appointments" WHERE "appointments"."nutritionist_id" = 1 AND "appointments"."status_id" = 1