backend/app/controllers/appointments_controller.rb

SELECT "appointments".* FROM "appointments"
SELECT "nutritionists".* FROM "nutritionists" WHERE "nutritionists"."id" IN (1, 3)
---
  def index
    @appointments = Appointment.includes(:guest, :nutritionist).all

SELECT "guests".* FROM "guests" WHERE "guests"."id" = 1 LIMIT 1
UPDATE "guests" SET "name" = 'Teste update', "updated_at" = '2025-09-10 12:18:41.209321' WHERE "guests"."id" = 4
UPDATE "appointments" SET "status_id" = 3 WHERE "appointments"."guest_id" = 9 AND "appointments"."status_id" = 1
INSERT INTO "guests" ("name", "email", "created_at", "updated_at") VALUES ('Tiago', 'tiago@gmail.com', '2025-09-09 18:16:19.261066', '2025-09-09 18:16:19.261066') RETURNING "id"
UPDATE "appointments" SET "status_id" = 4 WHERE "appointments"."guest_id" = 9 AND "appointments"."status_id" = 1
INSERT INTO "appointments" ("date", "status_id", "nutritionist_id", "created_at", "updated_at", "guest_id") VALUES ('2025-09-30 09:54:00', 1, 1, '2025-09-09 19:40:56.066061', '2025-09-09 19:40:56.066061', 9) RETURNING "id"
---
  def create
    @appointment = Appointment.new(
      {
        date: appointment_params[:date],
        status_id: 1,
        nutritionist_id: appointment_params[:nutritionist_id],
        guest: setup_guest
      })

      apps = Appointment.where(guest: @appointment.guest, status_id: 1)
      apps.update_all(status_id: 4)

      if @appointment.save

SELECT "nutritionists".* FROM "nutritionists" WHERE "nutritionists"."id" = 2 LIMIT 1
UPDATE "appointments" SET "status_id" = 1 WHERE "appointments"."nutritionist_id" = 1 AND "appointments"."date" = '2025-09-29 10:00:00' AND "appointments"."status_id" = 1
UPDATE "appointments" SET "status_id" = 2, "updated_at" = '2025-09-10 13:08:45.325509' WHERE "appointments"."id" = 4
---
  def accept
    apps = Appointment.where(nutritionist: @appointment.nutritionist, date: @appointment.date, status_id: 1)
    apps.update_all(status_id: 3)
    @appointment.update(status_id: 2)

UPDATE "appointments" SET "status_id" = 3, "updated_at" = '2025-09-10 13:18:25.792907' WHERE "appointments"."id" = 4
---
  def reject
    @appointment.update(status_id: 3)

SELECT "guests".* FROM "guests" WHERE "guests"."email" = 'test@test.com' LIMIT 1
SELECT "guests".* FROM "guests" WHERE "guests"."email" = 'tiagopimcosta@gmail.com' LIMIT 1
UPDATE "guests" SET "name" = 'Tiago Costa2', "updated_at" = '2025-09-10 13:44:06.198080' WHERE "guests"."id" = 4
INSERT INTO "guests" ("name", "email", "created_at", "updated_at") VALUES ('Tiago Costa', 'tiagopimcosta@gmail.com', '2025-09-10 12:17:22.576319', '2025-09-10 12:17:22.576319') RETURNING "id"
---
    def setup_guest
      email = appointment_params[:email]
      name = appointment_params[:name]
      guest = Guest.find_by(email: email)

      if guest.present? && name.present? && guest.name != name
        guest.update(name: name)
      end

      return guest unless guest.blank?

      Guest.create(name: name, email: email)