backend/app/controllers/appointments_controller.rb

  def accept
    apps = Appointments.where(nutritionist: @appointment.nutritionist, date: @appointment.date)
---
SELECT "nutritionists".* FROM "nutritionists" WHERE "nutritionists"."id" = 1 LIMIT 1

    def set_appointment
      @appointment = Appointment.find(params.expect(:id))
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = 58 LIMIT 1