backend/app/controllers/guests_controller.rb

    def set_guest
      @guest = Guest.find(params.expect(:id))
---
SELECT "guests".* FROM "guests" WHERE "guests"."id" = 1 LIMIT 1