backend/app/controllers/nutritionists_services_controller.rb

  def index
    filter = params[:filter].to_s.strip
    page = params[:page].to_i > 0 ? params[:page].to_i : 1
    per_page = params[:per_page].to_i > 0 ? params[:per_page].to_i : 3

    @nutritionists_services = NutritionistsService.includes(:nutritionist, :service).all

    if filter.present?
      @nutritionists_services = @nutritionists_services
        .joins(:nutritionist, :service)
        .where(
          "nutritionists.name ILIKE :filter OR services.name ILIKE :filter",
          filter: "%#{filter}%"
        ).distinct
    end

    total_count = @nutritionists_services.count
    @nutritionists_services = @nutritionists_services.offset((page - 1) * per_page).limit(per_page)
---
SELECT "nutritionists".* FROM "nutritionists" WHERE "nutritionists"."id" IN (1, 2, 3, 4, 5)
SELECT "nutritionists_services".* FROM "nutritionists_services"
SELECT "services".* FROM "services" WHERE "services"."id" IN (1, 2, 3, 4, 5)
SELECT COUNT(DISTINCT "nutritionists_services"."id") FROM "nutritionists_services" INNER JOIN "nutritionists" ON "nutritionists"."id" = "nutritionists_services"."nutritionist_id" INNER JOIN "services" ON "services"."id" = "nutritionists_services"."service_id" WHERE (nutritionists.name ILIKE '%Ti%' OR services.name ILIKE '%Ti%')
SELECT "nutritionists".* FROM "nutritionists" WHERE "nutritionists"."id" IN (1, 2)
SELECT "nutritionists_services".* FROM "nutritionists_services" LIMIT 3 OFFSET 0
SELECT "services".* FROM "services" WHERE "services"."id" IN (1, 2)

    def set_nutritionists_service
      @nutritionists_service = NutritionistsService.find(params.expect(:id))
---
SELECT "services".* FROM "services" WHERE "services"."id" = 1