backend/app/controllers/nutritionists_controller.rb

SELECT "services".* FROM "services" WHERE "services"."id" IN (2, 3)
SELECT "nutritionists".* FROM "nutritionists"
SELECT DISTINCT "nutritionists".* FROM "nutritionists" LEFT OUTER JOIN "nutritionists_services" ON "nutritionists_services"."nutritionist_id" = "nutritionists"."id" LEFT OUTER JOIN "services" ON "services"."id" = "nutritionists_services"."service_id" WHERE (nutritionists.name ILIKE '%a%' OR services.name ILIKE '%a%') ORDER BY "nutritionists"."id" ASC
SELECT COUNT(*) FROM (SELECT DISTINCT "nutritionists".* FROM "nutritionists" LEFT OUTER JOIN "nutritionists_services" ON "nutritionists_services"."nutritionist_id" = "nutritionists"."id" LEFT OUTER JOIN "services" ON "services"."id" = "nutritionists_services"."service_id" WHERE (nutritionists.name ILIKE '%clí%' OR services.name ILIKE '%clí%')) subquery_for_count
SELECT COUNT(*) FROM (SELECT DISTINCT "nutritionists".* FROM "nutritionists" LEFT OUTER JOIN "nutritionists_services" ON "nutritionists_services"."nutritionist_id" = "nutritionists"."id" LEFT OUTER JOIN "services" ON "services"."id" = "nutritionists_services"."service_id" WHERE (nutritionists.name ILIKE '%Ma%' OR services.name ILIKE '%Ma%')) subquery_for_count
SELECT DISTINCT "nutritionists".* FROM "nutritionists" LEFT OUTER JOIN "nutritionists_services" ON "nutritionists_services"."nutritionist_id" = "nutritionists"."id" LEFT OUTER JOIN "services" ON "services"."id" = "nutritionists_services"."service_id" WHERE (nutritionists.name ILIKE '%M%' OR services.name ILIKE '%M%')
---
  def index
    filter = params[:filter].to_s.strip
    page = params[:page].to_i > 0 ? params[:page].to_i : 1
    per_page = params[:per_page].to_i > 0 ? params[:per_page].to_i : 10

    @nutritionists = Nutritionist.includes(:services).all

    if filter.present?
      @nutritionists = @nutritionists
        .left_joins(:services)
        .where(
          "nutritionists.name ILIKE :filter OR services.name ILIKE :filter",
          filter: "%#{filter}%"
        ).order(:id).distinct
    end

    total_count = @nutritionists.count
    @nutritionists = @nutritionists.offset((page - 1) * per_page).limit(per_page)

SELECT "nutritionists".* FROM "nutritionists" WHERE "nutritionists"."id" = 1 LIMIT 1
SELECT "appointments".* FROM "appointments" WHERE "appointments"."nutritionist_id" = 1 AND "appointments"."status_id" = 1
SELECT "guests".* FROM "guests" WHERE "guests"."id" IN (4, 5)
---
  def pending_requests
    nutritionist = Nutritionist.find(params[:id])
    appointments = Appointment.where(nutritionist_id: nutritionist.id, status_id: 1).includes(:guest)

SELECT "nutritionists".* FROM "nutritionists" WHERE "nutritionists"."id" = NULL LIMIT 1
---
    def set_nutritionist
      @nutritionist = Nutritionist.find(params.expect(:id))