backend/app/controllers/services_controller.rb

    def set_service
      @service = Service.find(params.expect(:id))
---
SELECT "services".* FROM "services" WHERE "services"."id" = 2 LIMIT 1