backend/app/services/nutritionists_services_services/get_all_nutritionists_services.rb

    def call
      nutritionists_services = NutritionistsService.includes(:nutritionist, :service).all

      if filter.present?
        nutritionists_services = nutritionists_services
          .joins(:nutritionist, :service)
          .where(
            "nutritionists.name ILIKE :filter OR services.name ILIKE :filter",
            filter: "%#{filter}%"
          ).distinct
      end

      total_count = nutritionists_services.count
      nutritionists_services = nutritionists_services.offset((page - 1) * per_page).limit(per_page)
---
SELECT COUNT(DISTINCT "nutritionists_services"."id") FROM "nutritionists_services" INNER JOIN "nutritionists" ON "nutritionists"."id" = "nutritionists_services"."nutritionist_id" INNER JOIN "services" ON "services"."id" = "nutritionists_services"."service_id" WHERE (nutritionists.name ILIKE '%ca%' OR services.name ILIKE '%ca%')
SELECT "nutritionists".* FROM "nutritionists" WHERE "nutritionists"."id" IN (1, 2)
SELECT "nutritionists_services".* FROM "nutritionists_services" LIMIT 3 OFFSET 0
SELECT "services".* FROM "services" WHERE "services"."id" IN (1, 2)