backend/app/services/appointments_services/accept.rb

    def reject_overlapping_pending_appointments
      Appointment
        .for_nutritionist(@appointment.nutritionist.id)
        .pending
        .where.not(id: @appointment.id)
        .overlapping(@appointment.starts_at, @appointment.ends_at)
        .find_each { |conflicting| AppointmentsServices::Reject.new(conflicting.id).call }
---
SELECT "nutritionists".* FROM "nutritionists" WHERE "nutritionists"."id" = 1 LIMIT 1

    def setup_appointment
      @appointment = Appointment.find(appointment_id)
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = 58 LIMIT 1