backend/app/services/appointments_services/accept.rb

    def accept_appointment
      @appointment.update(status_id: 2)
---
UPDATE "appointments" SET "status_id" = 2, "updated_at" = '2025-09-11 15:42:13.843342' WHERE "appointments"."id" = 67