backend/app/services/appointments_services/create.rb

UPDATE "appointments" SET "status_id" = 4 WHERE "appointments"."guest_id" = 8 AND "appointments"."status_id" = 1
UPDATE "appointments" SET "status_id" = 4 WHERE "appointments"."guest_id" = 4 AND "appointments"."status_id" = 1
---
    def call
      apps = Appointment.where(guest: appointment.guest, status_id: 1)
      apps.update_all(status_id: 4)
      {
        success: appointment.save,
        records: nil,
        errors: nil

SELECT "guests".* FROM "guests" WHERE "guests"."email" = 'tiago3@gmail.com' LIMIT 1
UPDATE "guests" SET "name" = 'Teste', "updated_at" = '2025-09-11 15:24:25.930615' WHERE "guests"."id" = 4
SELECT "guests".* FROM "guests" WHERE "guests"."email" = 'teste@gmail.com' LIMIT 1
INSERT INTO "guests" ("name", "email", "created_at", "updated_at") VALUES ('Teste', 'tiago@gmail.com', '2025-09-11 16:29:03.697013', '2025-09-11 16:29:03.697013') RETURNING "id"
---
    def setup_guest
      guest = Guest.find_by(email: email)

      if guest.present? && name.present? && guest.name != name
        guest.update(name: name)
      end

      return guest unless guest.blank?

      Guest.create(name: name, email: email)