backend/app/services/appointments_services/reject.rb

UPDATE "appointments" SET "status_id" = 3, "updated_at" = '2025-09-11 16:32:51.398959' WHERE "appointments"."id" = 68
---
    def reject_appointment
      @appointment.update(status_id: 3)