backend/app/services/appointments_services/reject.rb

SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = 63 LIMIT 1
---
    def reject!
      Appointment.transaction do
        appointment = Appointment.lock.find(appointment_id)